<?php
// +----------------------------------------------------------------------
// | 互联在线
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2022 http://www.hlzx.com/ All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: arno <1065800888@qq.com>
// +----------------------------------------------------------------------
return [

    //模板参数替换
    'view_replace_str'       => array(
        '__CSS__'    => '/static/admin/css',
        '__JS__'     => '/static/admin/js',
        '__IMG__' => '/static/admin/images',
    ),

    //管理员状态
    'user_status' => [
        '1' => '正常',
        '2' => '禁止登录'
    ],
    //角色状态
    'role_status' => [
        '1' => '启用',
        '2' => '禁用'
    ],   
    //角色名称
	'role_type' => [
		'1' => '超级管理员',
		'7' => '会员',
		'8' => '钻石代理',
		'9' => '业务员',
		'10' => '运营',
		'11' => '体验代理',
		'12' => '黄金代理',
		'13' => '白银代理',
		'14' => '合伙人',
		'1001' => '线下渠道A级',
		'1002' => '线下渠道B级',
		'0' => '游戏服务器同步用户',
	],
	//分销级别
	'user_rank' => [
		'2' => '二级',
		'3' => '三级',
	],	
	//订单类型
	'orderstype' => [
		'0' => '充值订单',
		'1' => '奖励订单',
		'2' => '派发订单',
	    '3' => '代理订单',
	],
	//订单状态
	'ordersstatus' => [
		'0' => '未领取',
		'1' => '已领取',
	],		
];
