<?php
// +----------------------------------------------------------------------
// | 互联在线
// +----------------------------------------------------------------------
// | Copyright (c) 2016~2022 http://www.hlzx.com/ All rights reserved.
// +----------------------------------------------------------------------
// | Licensed ( http://www.apache.org/licenses/LICENSE-2.0 )
// +----------------------------------------------------------------------
// | Author: arno <1065800888@qq.com>
// +----------------------------------------------------------------------
return [

    //模板参数替换
    'view_replace_str'       => array(
        '__CSS__'    => '/static/mobile/css',
        '__JS__'     => '/static/mobile/js',
        '__IMG__' => '/static/mobile/img',
        '__3RD__' => '/static/mobile/3rd',
    ),



    'Wxkey' => [
        'APPID' => 'wxc045d46c203333fb',
        'SECRET' => '5d37f85a644bb107108cefd47abd9a9b'
    ],

    'Msgkey' => [
        'user' => 'ichinapay',
        'pasd' => 'ad3023ichinae7c3c24e'
    ],

    //分销级别
    'user_rank' => [
        '2' => '二级',
        '3' => '三级',
    ],  
    //订单类型
    'orderstype' => [
        '0' => '充值订单',
        '1' => '奖励订单',
        '2' => '派发订单',
    ],
    //订单状态
    'ordersstatus' => [
        '0' => '未领取',
        '1' => '已领取',
    ],
			
];
